app/controllers/carts_controller.rb

  def show
    @cart = Cart.find(params[:id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @cart = Cart.new(cart_params)
    if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2019-05-18 01:21:15.907413"], ["updated_at", "2019-05-18 01:21:15.907413"], ["user_id", 3]]

  def update
    @cart = Cart.find(params[:id])

    if @cart.update_attributes(cart_param)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "carts" SET "user_id" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["user_id", 5], ["updated_at", "2019-05-18 01:23:20.341290"], ["id", 1]]

  def destroy
    Cart.find(params[:id]).destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]