app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params)
    #@image.photo.attach(params[:photo])
    if @image.save
---
INSERT INTO "images" ("name", "imageable_id", "imageable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "newfile"], ["imageable_id", 1], ["imageable_type", "product"], ["created_at", "2019-06-29 15:03:09.832236"], ["updated_at", "2019-06-29 15:03:09.832236"]]