app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @message = Message.find(params[:id])

INSERT INTO "messages" ("text", "created_at", "updated_at", "chat_id") VALUES (?, ?, ?, ?)  [["text", "messagetextmessagetextmessagetext"], ["created_at", "2019-05-18 02:02:04.182780"], ["updated_at", "2019-05-18 02:02:04.182780"], ["chat_id", 5]]
---
  def create
    @message = Message.new(message_params)
    if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "messages" SET "text" = ?, "chat_id" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["text", "adifferentmessage Text"], ["chat_id", 7], ["updated_at", "2019-05-18 02:04:01.584651"], ["id", 1]]
---
  def update
    @message = Message.find(params[:id])

    if @message.update_attributes(message_param)

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 1]]
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    Message.find(params[:id]).destroy