app/controllers/products_controller.rb

  def getRatings
    @ratings = Rating.where("rateable_id = ? ",params[:id] ).where("rateable_type = 'Product'").paginate(page: params[:page], per_page: 5)
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."rateable_id" = ? AND "ratings"."rateable_type" = ? LIMIT ? OFFSET ?  [["rateable_id", 1], ["rateable_type", "Product"], ["LIMIT", 5], ["OFFSET", 0]]

  def productRating
    @ratings = Rating.where("rateable_id = ? ",params[:id] ).where("rateable_type = 'Product'")
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."rateable_id" = ? AND "ratings"."rateable_type" = ?  [["rateable_id", 1], ["rateable_type", "Product"]]