app/controllers/products_controller.rb

  def getKind
    @products = Product.where("kind = ?", params[:kind]).available.PriceOrder.paginate(page: params[:page], per_page: 5)
---
SELECT "products".* FROM "products" WHERE (kind = 'Pant') AND (quantity > 0)

  def getByName
    @products = Product.where("instr(name, ?) > 0", params[:name]).available.PriceOrder.paginate(page: params[:page], per_page: 5)
---
SELECT  "products".* FROM "products" WHERE (instr(name, 'Car') > 0) AND (quantity > 0) ORDER BY "products"."name" ASC, "products"."price" ASC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

  def create
    @product = Product.new(product_params)
    if @product.save
      render json: @product, status: :created, location: @product
      @user = User.find(@product.user_id)
---
INSERT INTO "products" ("name", "description", "price", "quantity", "kind", "gender", "new", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @product = Product.find(params[:id])

    if @product.update_attributes(product_param)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "description" = ?, "price" = ?, "kind" = ?, "new" = ?, "gender" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Abc"], ["description", "Test description"], ["price", 3], ["kind", "Testkind"], ["new", 1], ["gender", "Testgender"], ["updated_at", "2019-05-17 23:31:19.756904"], ["id", 1]]

  def destroy
    Product.find(params[:id]).destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]