app/controllers/ratings_controller.rb

SELECT "ratings".* FROM "ratings"
---
  def index
    @ratings = Rating.all

SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @rating = Rating.find(params[:id])

INSERT INTO "ratings" ("comment", "kind", "rating", "rateable_id", "rateable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["comment", "asdasdsad"], ["kind", "asd"], ["rating", 5], ["rateable_id", 1], ["rateable_type", "users"], ["created_at", "2019-06-16 06:28:43.811936"], ["updated_at", "2019-06-16 06:28:43.811936"]]
---
  def create
    @rating = Rating.new(rating_params)
    if @rating.save