app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    @tags = Tag.all.NameOrder

SELECT "tags".* FROM "tags" WHERE (name = 'Abra')
---
  def getByTag
    @tag = Tag.where("name = ?", params[:name])

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "testtagname"], ["created_at", "2019-05-18 02:36:44.640447"], ["updated_at", "2019-05-18 02:36:44.640447"]]
---
  def create
    @tag = Tag.new(tag_params)
    if @tag.save

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @tag = Tag.find(params[:id])

SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tags" SET "name" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["name", "anothertesttagname"], ["updated_at", "2019-05-18 02:37:32.825300"], ["id", 1]]
---
  def update
    @tag = Tag.find(params[:id])

    if @tag.update_attributes(tag_param)

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    Tag.find(params[:id]).destroy