app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
  def index
    @users = User.all.NameOrder

SELECT "ratings".* FROM "ratings" WHERE "ratings"."rateable_id" = ? AND "ratings"."rateable_type" = ?  [["rateable_id", 2], ["rateable_type", "User"]]
---
  def userRating
    @ratings = Rating.where("rateable_id = ? ",params[:id] ).where("rateable_type = 'User'")

SELECT "ratings".* FROM "ratings" WHERE "ratings"."rateable_id" = ? AND "ratings"."rateable_type" = ?  [["rateable_id", 1], ["rateable_type", "User"]]
---
  def getRatings
    @ratings = Rating.where("rateable_id = ? ",params[:id] ).where("rateable_type = 'User'").paginate(page: params[:page], per_page: 5)