app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "name", "residence", "role", "created_at", "updated_at", "email", "encrypted_password", "authentication_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(user_param)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "name" = ?, "description" = ?, "password" = ?, "residence" = ?, "role" = ?, "updated_at" = ? WHERE "users"."id" = ?