app/controllers/users_controller.rb

UPDATE "users" SET "username" = ?, "name" = ?, "email" = ?, "description" = ?, "residence" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(username: params[:username],
                                name: params[:name], email: params[:email], description: params[:description],
                                residence: params[:residence], role: params[:role])